<template>
  <div class="tip">
    <!-- 常见科室的结构 -->
    <div class="department">
      <div class="header">
        <div class="left">
            <svg t="1718890124867" class="icon" viewBox="0 0 1024 1024" version="1.1" xmlns="http://www.w3.org/2000/svg" p-id="10009" id="mx_n_1718890124869" width="20" height="20"><path d="M817.3 305.3H762V250c0-61.1-49.5-110.7-110.7-110.7H374.7C313.5 139.3 264 188.8 264 250v55.3h-55.3C147.5 305.3 98 354.8 98 416v359.7c0 61.1 49.5 110.7 110.7 110.7h608.7c61.1 0 110.7-49.5 110.7-110.7V416c-0.1-61.2-49.6-110.7-110.8-110.7z m-498-55.3c0-30.5 24.8-55.3 55.3-55.3h276.7c30.5 0 55.3 24.8 55.3 55.3v55.3H319.3V250z m553.4 525.6c0 30.5-24.8 55.3-55.3 55.3H208.7c-30.5 0-55.3-24.8-55.3-55.3V416c0-30.5 24.8-55.3 55.3-55.3H817.3c30.5 0 55.3 24.8 55.3 55.3v359.6z" p-id="10010"></path><path d="M540.7 471.3h-55.4V582H374.7v55.3h110.6V748h55.4V637.3h110.6V582H540.7z" p-id="10011"></path></svg>
            <span>常见科室</span>
        </div>
        <div class="right">
          全部<svg
            t="1718883106801"
            class="icon"
            viewBox="0 0 1024 1024"
            version="1.1"
            xmlns="http://www.w3.org/2000/svg"
            p-id="4154"
            width="16"
            height="16"
          >
            <path
              d="M326.5536 852.5824c110.3872-112.0256 219.3408-223.3344 329.3184-333.6192 13.824-13.9264 16.0768-20.8896 0.8192-35.9424-105.472-104.2432-209.6128-209.7152-314.6752-314.1632-11.264-11.264-14.7456-17.6128-0.8192-29.5936 19.5584-16.7936 37.0688-36.0448 54.784-54.784 7.3728-7.7824 11.776-10.0352 20.8896-0.9216C551.936 219.4432 687.4112 354.816 823.0912 489.984c8.192 8.192 8.704 12.6976 0.2048 21.1968A149528.7808 149528.7808 0 0 0 419.84 913.7152c-8.6016 8.6016-13.5168 10.4448-23.3472 1.1264-23.552-22.4256-48.5376-43.4176-69.9392-62.2592z"
              p-id="4155"
              fill="#1296db"
            ></path>
          </svg>
        </div>
      </div>
      <div class="content">
        <ul>
            <li>神经内科</li>
            <li>消化内科</li>
            <li>呼吸内科</li>
            <li>内科</li>
            <li>神经外科</li>
            <li>妇科</li>
            <li>产科</li>
            <li>儿科</li>
        </ul>
      </div>
    </div>
    <div class="platform">
        <div class="header">
            <div class="left">
                <svg t="1718889623625" class="icon" viewBox="0 0 1024 1024" version="1.1" xmlns="http://www.w3.org/2000/svg" p-id="6702" width="25" height="25"><path d="M872.802928 755.99406 872.864326 755.99406 872.864326 755.624646Z" fill="#7eabff" p-id="6703"></path><path d="M744.055658 192.799074c-4.814656-2.889817-9.601682-5.251607-15.442714-5.251607-14.262842 0-25.758664 11.559267-25.758664 25.805736 0 10.285251 6.088672 18.519796 14.6957 23.195282 94.679359 55.247278 158.344355 157.787676 158.344355 275.30416 0 117.424386-63.605643 219.931015-158.159136 275.18034-8.29492 4.538363-15.442714 13.050224-15.442714 23.583115 0 14.261818 11.559267 25.820062 25.791409 25.820062 5.716188 0 10.252505-2.202155 15.22475-5.063319 109.871363-64.133669 183.764304-183.143157 183.764304-319.520197C927.074995 375.785665 853.495186 257.010515 744.055658 192.799074z" fill="#7eabff" p-id="6704"></path><path d="M773.946432 511.867994c0-79.96524-43.344181-149.739373-107.821681-187.289594-2.920516-1.52268-9.785877-4.520967-14.603603-4.520967-14.325263 0-25.914206 11.589966-25.914206 25.89988 0 9.616008 5.096065 18.176988 12.865006 22.666232 49.839105 28.307719 83.45983 81.829703 83.45983 143.244448 0 62.472843-34.801621 116.817566-86.070284 144.750755-7.457856 4.538363-12.397355 12.803607-12.397355 22.188348 0 14.325263 11.588943 25.943882 25.882484 25.943882 6.090718 0.031722 13.33061-3.542686 13.33061-3.542686C729.048873 664.171772 773.946432 593.294514 773.946432 511.867994z" fill="#7eabff" p-id="6705"></path><path d="M541.3694 124.672464c-10.846022-5.219885-23.740704-3.790326-33.215496 3.712555-0.435928 0.358157-46.423309 36.914748-97.195669 74.296123-88.308255 65.081251-114.036219 75.925227-119.257128 77.649498l-110.6194 0c-0.63752 0-1.243317 0.062422-1.879813 0.093121l-56.504922 0c-14.231119 0-25.775037 11.543917-25.775037 25.775037l0 411.697573c0 14.261818 11.512195 25.761734 25.775037 25.761734l189.511191 0.027629c5.096065 1.865487 29.395494 13.0799 107.761306 76.999698 45.613874 37.162388 86.505189 73.485665 86.940095 73.829496 5.841032 5.218862 13.298887 7.92039 20.820188 7.92039 4.349051 0 8.729825-0.930185 12.862959-2.764973 11.277858-5.064342 18.517749-16.252149 18.517749-28.619828 0 0 0.031722-97.257068 0.031722-132.212184 0.808412-2.484587 1.213641-5.127787 1.213641-7.863085 0-2.792603-1.245364-578.026786-1.245364-578.026786C559.110459 140.892891 552.214399 129.924071 541.3694 124.672464zM508.308423 726.470653c0 1.494027-0.467651 94.617961-0.467651 94.617961-13.889335-11.745509-29.332049-24.64019-45.240367-37.507242-104.59008-84.702124-130.505309-91.816149-148.030451-91.816149-0.372483 0-0.683569 0.091074-1.025353 0.091074s-0.652869-0.091074-1.025353-0.091074L170.394297 691.765223c-18.037818 0-22.248723-5.128811-22.248723-23.246447L148.145573 352.559685c0-12.32163 1.461281-20.057825 16.298198-20.057825l128.065747 0c17.090237 0 43.315528-6.991228 157.787676-90.839915 20.383236-14.914688 40.330544-29.938869 57.544601-43.113937 0 0 0.373507 445.207781 0.467651 521.368368C507.779374 722.028481 508.308423 724.234729 508.308423 726.470653z" fill="#7eabff" p-id="6706"></path></svg>
                <span>平台公告</span>
            </div>
            <div class="right">全部<svg
            t="1718883106801"
            class="icon"
            viewBox="0 0 1024 1024"
            version="1.1"
            xmlns="http://www.w3.org/2000/svg"
            p-id="4154"
            width="16"
            height="16"
          >
            <path
              d="M326.5536 852.5824c110.3872-112.0256 219.3408-223.3344 329.3184-333.6192 13.824-13.9264 16.0768-20.8896 0.8192-35.9424-105.472-104.2432-209.6128-209.7152-314.6752-314.1632-11.264-11.264-14.7456-17.6128-0.8192-29.5936 19.5584-16.7936 37.0688-36.0448 54.784-54.784 7.3728-7.7824 11.776-10.0352 20.8896-0.9216C551.936 219.4432 687.4112 354.816 823.0912 489.984c8.192 8.192 8.704 12.6976 0.2048 21.1968A149528.7808 149528.7808 0 0 0 419.84 913.7152c-8.6016 8.6016-13.5168 10.4448-23.3472 1.1264-23.552-22.4256-48.5376-43.4176-69.9392-62.2592z"
              p-id="4155"
              fill="#1296db"
            ></path>
          </svg></div>
        </div>
        <div class="content">
            <ul>
                <li>
                    <svg t="1718887917674" class="icon" viewBox="0 0 1024 1024" version="1.1" xmlns="http://www.w3.org/2000/svg" p-id="5459" id="mx_n_1718887917676" width="14" height="14"><path d="M512 624a112 112 0 1 0 0-224 112 112 0 0 0 0 224z" p-id="5460" fill="#7eabff"></path></svg>
                    <span>关于延长北京大学国际医院放假的通知</span>
                </li>
                <li>
                    <svg t="1718887917674" class="icon" viewBox="0 0 1024 1024" version="1.1" xmlns="http://www.w3.org/2000/svg" p-id="5459" id="mx_n_1718887917676" width="14" height="14"><path d="M512 624a112 112 0 1 0 0-224 112 112 0 0 0 0 224z" p-id="5460" fill="#7eabff"></path></svg>
                    <span>北京中医药大学东方医院部分科室医生门诊医</span>
                </li>
                <li>
                    <svg t="1718887917674" class="icon" viewBox="0 0 1024 1024" version="1.1" xmlns="http://www.w3.org/2000/svg" p-id="5459" id="mx_n_1718887917676" width="14" height="14"><path d="M512 624a112 112 0 1 0 0-224 112 112 0 0 0 0 224z" p-id="5460" fill="#7eabff"></path></svg>
                    <span>武警总医院号源暂停更新通知</span>
                </li>
            </ul>
          </div>
    </div>
    <div class="clinic">
        <div class="header">
            <div class="left">
                <svg t="1718890043123" class="icon" viewBox="0 0 1024 1024" version="1.1" xmlns="http://www.w3.org/2000/svg" p-id="8323" width="20" height="20"><path d="M960 320h-224L588.8 147.2c12.8-12.8 19.2-32 19.2-51.2 0-25.6-12.8-51.2-25.6-70.4C563.2 12.8 537.6 0 512 0s-51.2 12.8-70.4 25.6c-12.8 19.2-25.6 44.8-25.6 70.4 0 19.2 6.4 38.4 19.2 57.6L294.4 320H64c-38.4 0-64 25.6-64 64v576c0 38.4 25.6 64 64 64h896c38.4 0 64-25.6 64-64V384c0-38.4-25.6-64-64-64zM460.8 172.8c12.8 12.8 32 19.2 51.2 19.2 19.2 0 38.4-6.4 57.6-19.2l128 147.2H339.2l121.6-147.2zM128 640h512v64H128v-64z m640 256H128v-64h640v64z m128-384H128V448h768v64z" fill="#ffaa51" p-id="8324"></path></svg>
                <span>停诊公告</span>
            </div>
            <div class="right">全部<svg
                t="1718883106801"
                class="icon"
                viewBox="0 0 1024 1024"
                version="1.1"
                xmlns="http://www.w3.org/2000/svg"
                p-id="4154"
                width="16"
                height="16"
                >
                <path
                d="M326.5536 852.5824c110.3872-112.0256 219.3408-223.3344 329.3184-333.6192 13.824-13.9264 16.0768-20.8896 0.8192-35.9424-105.472-104.2432-209.6128-209.7152-314.6752-314.1632-11.264-11.264-14.7456-17.6128-0.8192-29.5936 19.5584-16.7936 37.0688-36.0448 54.784-54.784 7.3728-7.7824 11.776-10.0352 20.8896-0.9216C551.936 219.4432 687.4112 354.816 823.0912 489.984c8.192 8.192 8.704 12.6976 0.2048 21.1968A149528.7808 149528.7808 0 0 0 419.84 913.7152c-8.6016 8.6016-13.5168 10.4448-23.3472 1.1264-23.552-22.4256-48.5376-43.4176-69.9392-62.2592z"
                p-id="4155"
                fill="#1296db"
                ></path>
            </svg></div>
        </div>
            <div class="content">
                <ul>
                    <li>
                        <svg t="1718887917674" class="icon" viewBox="0 0 1024 1024" version="1.1" xmlns="http://www.w3.org/2000/svg" p-id="5459" id="mx_n_1718887917676" width="14" height="14"><path d="M512 624a112 112 0 1 0 0-224 112 112 0 0 0 0 224z" p-id="5460" fill="#ffaa51"></path></svg>
                        <span>中国人民解放军总医院第六医学中心(原海军总医院)呼吸内科门诊停诊公告</span>
                    </li>
                    <li>
                        <svg t="1718887917674" class="icon" viewBox="0 0 1024 1024" version="1.1" xmlns="http://www.w3.org/2000/svg" p-id="5459" id="mx_n_1718887917676" width="14" height="14"><path d="M512 624a112 112 0 1 0 0-224 112 112 0 0 0 0 224z" p-id="5460" fill="#ffaa51"></path></svg>
                        <span>首都医科大学附属北京潞河医院老年医学科门诊停诊公告</span>
                    </li>
                    <li>
                        <svg t="1718887917674" class="icon" viewBox="0 0 1024 1024" version="1.1" xmlns="http://www.w3.org/2000/svg" p-id="5459" id="mx_n_1718887917676" width="14" height="14"><path d="M512 624a112 112 0 1 0 0-224 112 112 0 0 0 0 224z" p-id="5460" fill="#ffaa51"></path></svg>
                        <span>中日友好医院中西医结合心内科门诊停诊公告</span>
                    </li>
                </ul>
            </div>
    </div>
  </div>
</template>

<script setup lang="ts">
</script>

<style lang="scss" scoped>
.department {
  height: 166px;
  display: flex;
  flex-direction: column;
  justify-content: space-between;
  margin-bottom: 20px;
  .header {
    display: flex;
    height: 20px;
    justify-content: space-between;
    align-items: center;
    .left {
        display: flex;
        align-items: center;
        span{
            margin-left: 5px;
        }
    }
    .right {
      display: flex;
      align-items: center;
      font-size: 14px;
      color: #999;
    }
  }
  .content {
    display: flex;
    ul {
      display: flex;
      flex-wrap: wrap;
      li {
        margin: 10px 0 10px 0;
        width: 80px;
        font-size: 14px;
        color: #333;
      }
    }
  }
}
.platform{
    // height: 145px;
    display: flex;
    flex-direction: column;
    justify-content: space-between;
    margin-bottom: 20px;
    .header{
        height: 20px;
        display: flex;
        justify-content: space-between;
        align-items: center;
        .left{
            display: flex;
            align-items: center;
            span{
                margin-left: 5px;
            }
        }
        .right{
            display: flex;
            align-items: center;
            font-size: 14px;
            color: #999;
        }
    }
    .content{
        ul{
            display: flex;
            align-items: center;
            flex-wrap: wrap;
            li{
                display: flex;
                justify-content: space-between;
                align-items: center;
                span{
                    width: 180px;
                    margin: 15px 0px;
                    height: 14px;
                    overflow: hidden;
                    white-space: nowrap; 
                    text-overflow: ellipsis;
                    font-size: 14px;
                    color: #333;
                }
            }
        }
    }
}
.clinic{
    // height: 145px;
    display: flex;
    flex-direction: column;
    justify-content: space-between;
    margin-bottom: 20px;
    .header{
        height: 20px;
        display: flex;
        justify-content: space-between;
        align-items: center;
        .left{
            display: flex;
            align-items: center;
            span{
                margin-left: 5px;
            }
        }
        .right{
            display: flex;
            align-items: center;
            font-size: 14px;
            color: #999;
        }
    }
    .content{
        ul{
            display: flex;
            flex-wrap: wrap;
            li{
                display: flex;
                justify-content: space-between;
                align-items: center;
                span{
                    width: 180px;
                    margin: 15px 0px;
                    height: 14px;
                    overflow: hidden;
                    white-space: nowrap; 
                    text-overflow: ellipsis;
                    font-size: 14px;
                    color: #333;
                }
            }
        }
    }
}
</style>